TestRA.РасширениеTestRA/src/Catalogs/СоединенияAPI/СоединенияAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоединенияAPI</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрокси</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПрокси</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Соединение</name>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>EnumRef.ТипыОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Суффикс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TestRA.РасширениеTestRA/src/CommonModules/TestRAМетоды/Module.bsl
Функция ПолучитьНастройкиСоединения(ТипОперации, Соединение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоединенияAPIСоединение.Ссылка.Сервер КАК Сервер,
	|	СоединенияAPIСоединение.Ссылка.АдресAPI КАК АдресAPI,
	|	СоединенияAPIСоединение.Ссылка.Порт КАК Порт,
	|	СоединенияAPIСоединение.Ссылка.Логин КАК Логин,
	|	СоединенияAPIСоединение.Ссылка.Пароль КАК Пароль,
	|	СоединенияAPIСоединение.Ссылка.Таймаут КАК Таймаут,
	|	СоединенияAPIСоединение.Ссылка.SSL КАК SSL,
	|	СоединенияAPIСоединение.Ссылка.ПроксиИспользовать КАК ПроксиИспользовать,
	|	СоединенияAPIСоединение.Ссылка.ПортПрокси КАК ПортПрокси,
	|	СоединенияAPIСоединение.Ссылка.АдресПрокси КАК АдресПрокси,
	|	СоединенияAPIСоединение.Суффикс КАК Суффикс
	|ИЗ
	|	Справочник.СоединенияAPI.Соединение КАК СоединенияAPIСоединение
	|ГДЕ
	|	СоединенияAPIСоединение.ТипОперации = &ТипОперации
	|	И СоединенияAPIСоединение.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ТипОперации", ТипОперации);
	Запрос.УстановитьПараметр("Ссылка", Соединение);
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗапросУспешен", НЕ РезультатЗапроса.Пустой());
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТабЗнач = Запрос.Выполнить().Выгрузить();
		Для Каждого Колонка из ТабЗнач.Колонки Цикл 
			СтруктураВозврата.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТабЗнач[0]);
	КонецЕсли;
	Возврат СтруктураВозврата;	
	
КонецФункции 


Функция ПолучитьДанныеНаСервере(СсылкаСоединение) Экспорт
	
	СтруктураИЗJSON = Новый Структура;
	Если СсылкаСоединение.ЗапросУспешен Тогда
		HTTP_Соединение = TestRAПовторноИспользуемыеРас.СобратьHTTPСоединение(СсылкаСоединение);
		Результат = HTTP_Соединение.Получить(TestRAПовторноИспользуемыеРас.СобратьHTTPЗапрос(СсылкаСоединение));
		Если Результат.КодСостояния = 200 Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
			СтруктураИЗJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Иначе
			СтруктураИЗJSON = Новый Структура;
		КонецЕсли;
		СтруктураИЗJSON.Вставить("ЗапросУспешен", Результат.КодСостояния = 200);
	Иначе
		СтруктураИЗJSON.Вставить("ЗапросУспешен", СсылкаСоединение.ЗапросУспешен);
	КонецЕсли;
	
	Возврат СтруктураИЗJSON;
	
КонецФункции
